espressif/esp-idf/components/soc/esp32s2/register/soc/dedic_gpio_reg.h
/** Status registers */

/** DEDIC_GPIO_OUT_SCAN_REG register
 *  Dedicated GPIO Output Status
 *  register
 */
#define DEDIC_GPIO_OUT_SCAN_REG (DR_REG_DEDICATED_GPIO_BASE + 0xc)
/* DEDIC_GPIO_OUT_STATUS : RO; bitpos: [8:0]; default: 0;
 * gpio out value configured by DEDIC_GPIO_OUT_DRT_REG,
 * DEDIC_GPIO_OUT_MSK_REG,
 * DEDIC_GPIO_OUT_IDV_REG.
 */
#define DEDIC_GPIO_OUT_STATUS    0x000000FF
#define DEDIC_GPIO_OUT_STATUS_M  (DEDIC_GPIO_OUT_STATUS_V << DEDIC_GPIO_OUT_STATUS_S)
#define DEDIC_GPIO_OUT_STATUS_V  0x000000FF
#define DEDIC_GPIO_OUT_STATUS_S  0

/** DEDIC_GPIO_IN_SCAN_REG register
 *  Dedicated GPIO Input Status
 *  register
 */
#define DEDIC_GPIO_IN_SCAN_REG (DR_REG_DEDICATED_GPIO_BASE + 0x18)
/* DEDIC_GPIO_IN_STATUS : RO; bitpos: [8:0]; default: 0;
 * gpio in value after configured by
 * DEDIC_GPIO_IN_DLY_REG.
 */
#define DEDIC_GPIO_IN_STATUS    0x000000FF
#define DEDIC_GPIO_IN_STATUS_M  (DEDIC_GPIO_IN_STATUS_V << DEDIC_GPIO_IN_STATUS_S)
#define DEDIC_GPIO_IN_STATUS_V  0x000000FF
#define DEDIC_GPIO_IN_STATUS_S  0


/** Interrupt registers */

/** DEDIC_GPIO_INTR_RAW_REG register
 *  Raw interrupt
 *  status
 */
#define DEDIC_GPIO_INTR_RAW_REG (DR_REG_DEDICATED_GPIO_BASE + 0x20)
/* DEDIC_GPIO0_INT_RAW : RO; bitpos: [0]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 0 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO0_INT_RAW    (BIT(0))
#define DEDIC_GPIO0_INT_RAW_M  (DEDIC_GPIO0_INT_RAW_V << DEDIC_GPIO0_INT_RAW_S)
#define DEDIC_GPIO0_INT_RAW_V  0x00000001
#define DEDIC_GPIO0_INT_RAW_S  0
/* DEDIC_GPIO1_INT_RAW : RO; bitpos: [1]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 1 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO1_INT_RAW    (BIT(1))
#define DEDIC_GPIO1_INT_RAW_M  (DEDIC_GPIO1_INT_RAW_V << DEDIC_GPIO1_INT_RAW_S)
#define DEDIC_GPIO1_INT_RAW_V  0x00000001
#define DEDIC_GPIO1_INT_RAW_S  1
/* DEDIC_GPIO2_INT_RAW : RO; bitpos: [2]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 2 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO2_INT_RAW    (BIT(2))
#define DEDIC_GPIO2_INT_RAW_M  (DEDIC_GPIO2_INT_RAW_V << DEDIC_GPIO2_INT_RAW_S)
#define DEDIC_GPIO2_INT_RAW_V  0x00000001
#define DEDIC_GPIO2_INT_RAW_S  2
/* DEDIC_GPIO3_INT_RAW : RO; bitpos: [3]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 3 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO3_INT_RAW    (BIT(3))
#define DEDIC_GPIO3_INT_RAW_M  (DEDIC_GPIO3_INT_RAW_V << DEDIC_GPIO3_INT_RAW_S)
#define DEDIC_GPIO3_INT_RAW_V  0x00000001
#define DEDIC_GPIO3_INT_RAW_S  3
/* DEDIC_GPIO4_INT_RAW : RO; bitpos: [4]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 4 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO4_INT_RAW    (BIT(4))
#define DEDIC_GPIO4_INT_RAW_M  (DEDIC_GPIO4_INT_RAW_V << DEDIC_GPIO4_INT_RAW_S)
#define DEDIC_GPIO4_INT_RAW_V  0x00000001
#define DEDIC_GPIO4_INT_RAW_S  4
/* DEDIC_GPIO5_INT_RAW : RO; bitpos: [5]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 5 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO5_INT_RAW    (BIT(5))
#define DEDIC_GPIO5_INT_RAW_M  (DEDIC_GPIO5_INT_RAW_V << DEDIC_GPIO5_INT_RAW_S)
#define DEDIC_GPIO5_INT_RAW_V  0x00000001
#define DEDIC_GPIO5_INT_RAW_S  5
/* DEDIC_GPIO6_INT_RAW : RO; bitpos: [6]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 6 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO6_INT_RAW    (BIT(6))
#define DEDIC_GPIO6_INT_RAW_M  (DEDIC_GPIO6_INT_RAW_V << DEDIC_GPIO6_INT_RAW_S)
#define DEDIC_GPIO6_INT_RAW_V  0x00000001
#define DEDIC_GPIO6_INT_RAW_S  6
/* DEDIC_GPIO7_INT_RAW : RO; bitpos: [7]; default: 0;
 * This interrupt raw bit turns to high level when dedicated GPIO 7 has
 * level/edge change configured by
 * DEDIC_GPIO_INTR_RCGN_REG.
 */
#define DEDIC_GPIO7_INT_RAW    (BIT(7))
#define DEDIC_GPIO7_INT_RAW_M  (DEDIC_GPIO7_INT_RAW_V << DEDIC_GPIO7_INT_RAW_S)
#define DEDIC_GPIO7_INT_RAW_V  0x00000001
#define DEDIC_GPIO7_INT_RAW_S  7

/** DEDIC_GPIO_INTR_RLS_REG register
 *  Interrupt enable
 *  bits
 */
#define DEDIC_GPIO_INTR_RLS_REG (DR_REG_DEDICATED_GPIO_BASE + 0x24)
/* DEDIC_GPIO0_INT_ENA : R/W; bitpos: [0]; default: 0;
 * This enable bit for reg_gpio0_int_st
 * register.
 */
#define DEDIC_GPIO0_INT_ENA    (BIT(0))
#define DEDIC_GPIO0_INT_ENA_M  (DEDIC_GPIO0_INT_ENA_V << DEDIC_GPIO0_INT_ENA_S)
#define DEDIC_GPIO0_INT_ENA_V  0x00000001
#define DEDIC_GPIO0_INT_ENA_S  0
/* DEDIC_GPIO1_INT_ENA : R/W; bitpos: [1]; default: 0;
 * This enable bit for reg_gpio1_int_st
 * register.
 */
#define DEDIC_GPIO1_INT_ENA    (BIT(1))
#define DEDIC_GPIO1_INT_ENA_M  (DEDIC_GPIO1_INT_ENA_V << DEDIC_GPIO1_INT_ENA_S)
#define DEDIC_GPIO1_INT_ENA_V  0x00000001
#define DEDIC_GPIO1_INT_ENA_S  1
/* DEDIC_GPIO2_INT_ENA : R/W; bitpos: [2]; default: 0;
 * This enable bit for reg_gpio2_int_st
 * register.
 */
#define DEDIC_GPIO2_INT_ENA    (BIT(2))
#define DEDIC_GPIO2_INT_ENA_M  (DEDIC_GPIO2_INT_ENA_V << DEDIC_GPIO2_INT_ENA_S)
#define DEDIC_GPIO2_INT_ENA_V  0x00000001
#define DEDIC_GPIO2_INT_ENA_S  2
/* DEDIC_GPIO3_INT_ENA : R/W; bitpos: [3]; default: 0;
 * This enable bit for reg_gpio3_int_st
 * register.
 */
#define DEDIC_GPIO3_INT_ENA    (BIT(3))
#define DEDIC_GPIO3_INT_ENA_M  (DEDIC_GPIO3_INT_ENA_V << DEDIC_GPIO3_INT_ENA_S)
#define DEDIC_GPIO3_INT_ENA_V  0x00000001
#define DEDIC_GPIO3_INT_ENA_S  3
/* DEDIC_GPIO4_INT_ENA : R/W; bitpos: [4]; default: 0;
 * This enable bit for reg_gpio4_int_st
 * register.
 */
#define DEDIC_GPIO4_INT_ENA    (BIT(4))
#define DEDIC_GPIO4_INT_ENA_M  (DEDIC_GPIO4_INT_ENA_V << DEDIC_GPIO4_INT_ENA_S)
#define DEDIC_GPIO4_INT_ENA_V  0x00000001
#define DEDIC_GPIO4_INT_ENA_S  4
/* DEDIC_GPIO5_INT_ENA : R/W; bitpos: [5]; default: 0;
 * This enable bit for reg_gpio5_int_st
 * register.
 */
#define DEDIC_GPIO5_INT_ENA    (BIT(5))
#define DEDIC_GPIO5_INT_ENA_M  (DEDIC_GPIO5_INT_ENA_V << DEDIC_GPIO5_INT_ENA_S)
#define DEDIC_GPIO5_INT_ENA_V  0x00000001
#define DEDIC_GPIO5_INT_ENA_S  5
/* DEDIC_GPIO6_INT_ENA : R/W; bitpos: [6]; default: 0;
 * This enable bit for reg_gpio6_int_st
 * register.
 */
#define DEDIC_GPIO6_INT_ENA    (BIT(6))
#define DEDIC_GPIO6_INT_ENA_M  (DEDIC_GPIO6_INT_ENA_V << DEDIC_GPIO6_INT_ENA_S)
#define DEDIC_GPIO6_INT_ENA_V  0x00000001
#define DEDIC_GPIO6_INT_ENA_S  6
/* DEDIC_GPIO7_INT_ENA : R/W; bitpos: [7]; default: 0;
 * This enable bit for reg_gpio7_int_st
 * register.
 */
#define DEDIC_GPIO7_INT_ENA    (BIT(7))
#define DEDIC_GPIO7_INT_ENA_M  (DEDIC_GPIO7_INT_ENA_V << DEDIC_GPIO7_INT_ENA_S)
#define DEDIC_GPIO7_INT_ENA_V  0x00000001
#define DEDIC_GPIO7_INT_ENA_S  7

/** DEDIC_GPIO_INTR_ST_REG register
 *  Masked interrupt
 *  status
 */
#define DEDIC_GPIO_INTR_ST_REG (DR_REG_DEDICATED_GPIO_BASE + 0x28)
/* DEDIC_GPIO0_INT_ST : RO; bitpos: [0]; default: 0;
 * This is the status bit for reg_gpio0_int_raw when reg_gpio0_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO0_INT_ST    (BIT(0))
#define DEDIC_GPIO0_INT_ST_M  (DEDIC_GPIO0_INT_ST_V << DEDIC_GPIO0_INT_ST_S)
#define DEDIC_GPIO0_INT_ST_V  0x00000001
#define DEDIC_GPIO0_INT_ST_S  0
/* DEDIC_GPIO1_INT_ST : RO; bitpos: [1]; default: 0;
 * This is the status bit for reg_gpio1_int_raw when reg_gpio1_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO1_INT_ST    (BIT(1))
#define DEDIC_GPIO1_INT_ST_M  (DEDIC_GPIO1_INT_ST_V << DEDIC_GPIO1_INT_ST_S)
#define DEDIC_GPIO1_INT_ST_V  0x00000001
#define DEDIC_GPIO1_INT_ST_S  1
/* DEDIC_GPIO2_INT_ST : RO; bitpos: [2]; default: 0;
 * This is the status bit for reg_gpio2_int_raw when reg_gpio2_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO2_INT_ST    (BIT(2))
#define DEDIC_GPIO2_INT_ST_M  (DEDIC_GPIO2_INT_ST_V << DEDIC_GPIO2_INT_ST_S)
#define DEDIC_GPIO2_INT_ST_V  0x00000001
#define DEDIC_GPIO2_INT_ST_S  2
/* DEDIC_GPIO3_INT_ST : RO; bitpos: [3]; default: 0;
 * This is the status bit for reg_gpio3_int_raw when reg_gpio3_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO3_INT_ST    (BIT(3))
#define DEDIC_GPIO3_INT_ST_M  (DEDIC_GPIO3_INT_ST_V << DEDIC_GPIO3_INT_ST_S)
#define DEDIC_GPIO3_INT_ST_V  0x00000001
#define DEDIC_GPIO3_INT_ST_S  3
/* DEDIC_GPIO4_INT_ST : RO; bitpos: [4]; default: 0;
 * This is the status bit for reg_gpio4_int_raw when reg_gpio4_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO4_INT_ST    (BIT(4))
#define DEDIC_GPIO4_INT_ST_M  (DEDIC_GPIO4_INT_ST_V << DEDIC_GPIO4_INT_ST_S)
#define DEDIC_GPIO4_INT_ST_V  0x00000001
#define DEDIC_GPIO4_INT_ST_S  4
/* DEDIC_GPIO5_INT_ST : RO; bitpos: [5]; default: 0;
 * This is the status bit for reg_gpio5_int_raw when reg_gpio5_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO5_INT_ST    (BIT(5))
#define DEDIC_GPIO5_INT_ST_M  (DEDIC_GPIO5_INT_ST_V << DEDIC_GPIO5_INT_ST_S)
#define DEDIC_GPIO5_INT_ST_V  0x00000001
#define DEDIC_GPIO5_INT_ST_S  5
/* DEDIC_GPIO6_INT_ST : RO; bitpos: [6]; default: 0;
 * This is the status bit for reg_gpio6_int_raw when reg_gpio6_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO6_INT_ST    (BIT(6))
#define DEDIC_GPIO6_INT_ST_M  (DEDIC_GPIO6_INT_ST_V << DEDIC_GPIO6_INT_ST_S)
#define DEDIC_GPIO6_INT_ST_V  0x00000001
#define DEDIC_GPIO6_INT_ST_S  6
/* DEDIC_GPIO7_INT_ST : RO; bitpos: [7]; default: 0;
 * This is the status bit for reg_gpio7_int_raw when reg_gpio7_int_ena is
 * set to
 * 1.
 */
#define DEDIC_GPIO7_INT_ST    (BIT(7))
#define DEDIC_GPIO7_INT_ST_M  (DEDIC_GPIO7_INT_ST_V << DEDIC_GPIO7_INT_ST_S)
#define DEDIC_GPIO7_INT_ST_V  0x00000001
#define DEDIC_GPIO7_INT_ST_S  7

/** DEDIC_GPIO_INTR_CLR_REG register
 *  Interrupt clear
 *  bits
 */
#define DEDIC_GPIO_INTR_CLR_REG (DR_REG_DEDICATED_GPIO_BASE + 0x2c)
/* DEDIC_GPIO0_INT_CLR : WO; bitpos: [0]; default: 0;
 * Set this bit to clear the reg_gpio0_int_raw
 * interrupt.
 */
#define DEDIC_GPIO0_INT_CLR    (BIT(0))
#define DEDIC_GPIO0_INT_CLR_M  (DEDIC_GPIO0_INT_CLR_V << DEDIC_GPIO0_INT_CLR_S)
#define DEDIC_GPIO0_INT_CLR_V  0x00000001
#define DEDIC_GPIO0_INT_CLR_S  0
/* DEDIC_GPIO1_INT_CLR : WO; bitpos: [1]; default: 0;
 * Set this bit to clear the reg_gpio1_int_raw
 * interrupt.
 */
#define DEDIC_GPIO1_INT_CLR    (BIT(1))
#define DEDIC_GPIO1_INT_CLR_M  (DEDIC_GPIO1_INT_CLR_V << DEDIC_GPIO1_INT_CLR_S)
#define DEDIC_GPIO1_INT_CLR_V  0x00000001
#define DEDIC_GPIO1_INT_CLR_S  1
/* DEDIC_GPIO2_INT_CLR : WO; bitpos: [2]; default: 0;
 * Set this bit to clear the reg_gpio2_int_raw
 * interrupt.
 */
#define DEDIC_GPIO2_INT_CLR    (BIT(2))
#define DEDIC_GPIO2_INT_CLR_M  (DEDIC_GPIO2_INT_CLR_V << DEDIC_GPIO2_INT_CLR_S)
#define DEDIC_GPIO2_INT_CLR_V  0x00000001
#define DEDIC_GPIO2_INT_CLR_S  2
/* DEDIC_GPIO3_INT_CLR : WO; bitpos: [3]; default: 0;
 * Set this bit to clear the reg_gpio3_int_raw
 * interrupt.
 */
#define DEDIC_GPIO3_INT_CLR    (BIT(3))
#define DEDIC_GPIO3_INT_CLR_M  (DEDIC_GPIO3_INT_CLR_V << DEDIC_GPIO3_INT_CLR_S)
#define DEDIC_GPIO3_INT_CLR_V  0x00000001
#define DEDIC_GPIO3_INT_CLR_S  3
/* DEDIC_GPIO4_INT_CLR : WO; bitpos: [4]; default: 0;
 * Set this bit to clear the reg_gpio4_int_raw
 * interrupt.
 */
#define DEDIC_GPIO4_INT_CLR    (BIT(4))
#define DEDIC_GPIO4_INT_CLR_M  (DEDIC_GPIO4_INT_CLR_V << DEDIC_GPIO4_INT_CLR_S)
#define DEDIC_GPIO4_INT_CLR_V  0x00000001
#define DEDIC_GPIO4_INT_CLR_S  4
/* DEDIC_GPIO5_INT_CLR : WO; bitpos: [5]; default: 0;
 * Set this bit to clear the reg_gpio5_int_raw
 * interrupt.
 */
#define DEDIC_GPIO5_INT_CLR    (BIT(5))
#define DEDIC_GPIO5_INT_CLR_M  (DEDIC_GPIO5_INT_CLR_V << DEDIC_GPIO5_INT_CLR_S)
#define DEDIC_GPIO5_INT_CLR_V  0x00000001
#define DEDIC_GPIO5_INT_CLR_S  5
/* DEDIC_GPIO6_INT_CLR : WO; bitpos: [6]; default: 0;
 * Set this bit to clear the reg_gpio6_int_raw
 * interrupt.
 */
#define DEDIC_GPIO6_INT_CLR    (BIT(6))
#define DEDIC_GPIO6_INT_CLR_M  (DEDIC_GPIO6_INT_CLR_V << DEDIC_GPIO6_INT_CLR_S)
#define DEDIC_GPIO6_INT_CLR_V  0x00000001
#define DEDIC_GPIO6_INT_CLR_S  6
/* DEDIC_GPIO7_INT_CLR : WO; bitpos: [7]; default: 0;
 * Set this bit to clear the reg_gpio7_int_raw
 * interrupt.
 */
#define DEDIC_GPIO7_INT_CLR    (BIT(7))
#define DEDIC_GPIO7_INT_CLR_M  (DEDIC_GPIO7_INT_CLR_V << DEDIC_GPIO7_INT_CLR_S)
#define DEDIC_GPIO7_INT_CLR_V  0x00000001
#define DEDIC_GPIO7_INT_CLR_S  7

#ifdef __cplusplus
}
#endif
